Revit 2026 API

# RebarShapeDrivenAccessorTopFinishingTurns Property

---

For a spiral, the number of finishing turns at the upper end of the spiral.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int TopFinishingTurns { get; set; }
```
```vb
Public Property TopFinishingTurns As Integer
	Get
	Set
```
```cpp
public:
property int TopFinishingTurns {
	int get ();
	void set (int value);
}
```
```fsharp
member TopFinishingTurns : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: turns must be between 0 and 100. |
| InvalidOperationException | This RebarShapeDrivenAccessor is not an instance of a spiral shape. -or- This RebarShapeDrivenAccessor doesn't contain a valid rebar reference. |

Applies only to instances where RebarShape.Definition is of type RebarShapeDefinitionByArc, and its Type property is equal to the value RebarShapeDefinitionByArcType.Spiral.

#### Reference

RebarShapeDrivenAccessor Class

Autodesk.Revit.DB.Structure Namespace